---
kind: type
id: T:Autodesk.Revit.DB.ParameterFilterUtilities
source: html/50afdc29-3a0c-e3d9-c547-0fcdb40d3ce8.htm
---
# Autodesk.Revit.DB.ParameterFilterUtilities

Contains static utility functions for enumerating the categories and parameters that
 are available for use by ParameterFilterElement objects.

## Syntax (C#)
```csharp
public static class ParameterFilterUtilities
```